Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.StartOffsetType Property
 Gets or sets a value indicating whether the start offset is exact or minimum. If the start offset is minimum the spacing algorithm may determine a larger offset.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing.OffsetEnum StartOffsetType { get; set; }
Public Property StartOffsetType As RebarSpacing.OffsetEnum
	Get
	Set
Property Value
Type: RebarSpacing.OffsetEnum
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace